Enterprise_Serivces/Prod/Bronze4/CSLRealmUserService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/realmuser/contracts/2010/05/IRealmUserService/GetRealmUserByClaimedIdentifier</wsa:Action><wsa:MessageID>uuid:15c9a00f-3b24-47d0-a3e9-3dac4dff5ec8</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslrealmuserserviceqa1.testgs.pvt/RealmUserService.svc</wsa:To></soap:Header><soap:Body><GetRealmUserByClaimedIdentifier xmlns="http://www.gamestop.com/services/csl/realmuser/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><OpenIDClaimedIdentifier xmlns="http://www.gamestop.com/services/csl/realmuser/contracts/messages/2010/05">https://loginqa.gamestop.com/ID/dz79PLgXNkWwlG6rsevhuw</OpenIDClaimedIdentifier></request></GetRealmUserByClaimedIdentifier></soap:Body></soap:Envelope>